Jared-Linn/smart-parking-stm32/HARDWARE/ADC/adc.c
#include "adc.h"
#include "stm32f10x_adc.h"
#include "delay.h"

/**************************************************************
*功  能：	初始化ADC 
*参  数：	无
*返回值：	无
**************************************************************/
void  Adc_Init(void)
{ 	
	//定义结构体变量
	ADC_InitTypeDef ADC_InitStructure; 
	GPIO_InitTypeDef GPIO_InitStructure;
	//使能ADC1通道时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |RCC_APB2Periph_ADC1, ENABLE );	  
	//设置ADC分频因子6 72M/6=12,ADC最大时间不能超过14M
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);  
	//PA1 PA0作为模拟通道输入引脚                         
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1|GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;		//模拟输入引脚
	GPIO_Init(GPIOA, &GPIO_InitStructure);	
	//复位ADC1,将外设 ADC1 的全部寄存器重设为缺省值
	ADC_DeInit(ADC1);  
	//ADC设置
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	//ADC工作模式:ADC1和ADC2工作在独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;	      //模数转换工作在单通道模式
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;	//模数转换工作在单次转换模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//转换由软件而不是外部触发启动
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	            //ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = 2;	            //顺序进行规则转换的ADC通道的数目
	ADC_Init(ADC1, &ADC_InitStructure);            	    //根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器   
	//使能指定的ADC1
	ADC_Cmd(ADC1, ENABLE);	                   
	//使能复位校准  
	ADC_ResetCalibration(ADC1);	                
	//等待复位校准结束
	while(ADC_GetResetCalibrationStatus(ADC1));	
	//开启AD校准
	ADC_StartCalibration(ADC1);	                
	//等待校准结束
	while(ADC_GetCalibrationStatus(ADC1));	   

}	

/**************************************************************
*功  能：	获得ADC值
*参  数：	ch：通道值
*返回值：	ADC值
**************************************************************/
uint16_t Get_Adc(uint8_t ch)   
{
	//设置指定ADC的规则组通道，一个序列，采样时间
	ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_239Cycles5 );	//ADC1,ADC通道,采样时间为239.5周期	  			    
	//使能指定的ADC1的软件转换启动功能	
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);		
	//等待转换结束
	while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ));
	//返回最近一次ADC1规则组的转换结果
	return ADC_GetConversionValue(ADC1);	
}

/**************************************************************
*功  能：	获得ADC平均值
*参  数：	ch：通道值  times：采样次数
*返回值：	ADC平均值
**************************************************************/
uint16_t Get_Adc_Average(uint8_t ch,uint8_t times)
{
	uint32_t temp_val = 0;
	uint8_t t;
	for(t = 0;t < times;t++)
	{
		temp_val += Get_Adc(ch);
		Delay_ms(5);
	}
	return temp_val / times;
} 	
//										endfile